# PANDAS

## DataFrame

- Mengenal struktur data dari DataFrame
- Membuat dataframe from sctratch
- Meload data dari suatu file
- Beberapa attribute

**Struktur DataFrame**
- DataFrame merupakan struktur data 2 dimensi, dimana memiliki baris dan kolom
- Mempunyai index dan value
- Baris juga bisa disebut sebagai record atau 1 objek observasi
- Kolom juga bisa disebut sebagai variabel

- DataFrame bisa dibuat menggunakan list dan dict

In [2]:
import pandas as pd

In [2]:
pd.DataFrame?

In [2]:
# membuat dict

data_sekolah = {
    "Nama_siswa" : ["bagus", "mikiw", "nisa"],
    "Kelas" : [11, 12, 11]
}

In [4]:
# membuat dataframe dari dict

exer = pd.DataFrame(data_sekolah)

In [7]:
exer.head()

  Nama_siswa  Kelas
0      bagus     11
1      mikiw     12
2       nisa     11

In [6]:
for i in exer.columns:
    print(i)

Nama_siswa
Kelas

In [5]:
!dir

 Volume in drive C is Windows-SSD
 Volume Serial Number is 82F5-7B34

 Directory of C:\Exploratory Data Analysis\Data Analysis

11/26/2021  02:35 PM    <DIR>          .
06/25/2021  04:45 PM    <DIR>          ..
11/26/2021  02:19 PM    <DIR>          .ipynb_checkpoints
06/16/2021  02:55 PM         1,213,225 apps.csv
09/03/2020  11:14 AM    <DIR>          Data Manipulating in Pandas
09/28/2020  10:48 AM         5,619,684 data.csv
11/25/2021  05:05 PM            91,783 data_cleaning.ipynb
11/20/2020  11:43 PM             3,585 Exploratory Data Analysis NOTE.ipynb
04/05/2021  02:50 PM           237,671 Exploratory Data Analysis.ipynb
04/02/2021  09:13 AM           460,676 iowa_data.csv
11/25/2021  05:00 PM           489,653 Missing Value NOTE.ipynb
11/25/2021  05:00 PM            33,717 Missing Value.ipynb
12/21/2020  12:14 PM           361,767 Missing_Value.png
10/17/2020  11:33 PM    <DIR>          Module 2
11/26/2021  02:35 PM             2,033 Pandas - DataFrame.ipynb
11/26/2021  02:20 PM             8,755 Pandas - Series.ipynb
03/31/2021  04:17 PM           107,203 Pandas.ipynb
11/26/2021  01:29 PM           431,446 xxx Android apps.ipynb
              13 File(s)      9,061,198 bytes
               5 Dir(s)  876,087,529,472 bytes free

In [7]:
pd.read_csv?

In [8]:
pd.read_excel?

In [9]:
pd.read_sql?

- Penggunaan parameter dalam setiap pemanggilan data, tergantung pada kerapihan pada tsb

In [3]:
# meload data

df = pd.read_csv("iowa_data.csv")

In [4]:
df.head()

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition,SalePrice
0,1,60,RL,65.0,8450,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2008,WD,Normal,208500
1,2,20,RL,80.0,9600,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,5,2007,WD,Normal,181500
2,3,60,RL,68.0,11250,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,9,2008,WD,Normal,223500
3,4,70,RL,60.0,9550,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2006,WD,Abnorml,140000
4,5,60,RL,84.0,14260,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,12,2008,WD,Normal,250000

In [5]:
import matplotlib.pyplot as plt

In [6]:
df_try = df[["LotShape", "YrSold"]]

In [7]:
df_try.head()

  LotShape  YrSold
0      Reg    2008
1      Reg    2007
2      IR1    2008
3      IR1    2006
4      IR1    2008

In [13]:
df.index

RangeIndex(start=0, stop=1460, step=1)

In [ ]:
# merubah index
# df.index = df["Id"]

In [16]:
df.shape

(1460, 81)

In [14]:
df.columns

Index(['Id', 'MSSubClass', 'MSZoning', 'LotFrontage', 'LotArea', 'Street',
       'Alley', 'LotShape', 'LandContour', 'Utilities', 'LotConfig',
       'LandSlope', 'Neighborhood', 'Condition1', 'Condition2', 'BldgType',
       'HouseStyle', 'OverallQual', 'OverallCond', 'YearBuilt', 'YearRemodAdd',
       'RoofStyle', 'RoofMatl', 'Exterior1st', 'Exterior2nd', 'MasVnrType',
       'MasVnrArea', 'ExterQual', 'ExterCond', 'Foundation', 'BsmtQual',
       'BsmtCond', 'BsmtExposure', 'BsmtFinType1', 'BsmtFinSF1',
       'BsmtFinType2', 'BsmtFinSF2', 'BsmtUnfSF', 'TotalBsmtSF', 'Heating',
       'HeatingQC', 'CentralAir', 'Electrical', '1stFlrSF', '2ndFlrSF',
       'LowQualFinSF', 'GrLivArea', 'BsmtFullBath', 'BsmtHalfBath', 'FullBath',
       'HalfBath', 'BedroomAbvGr', 'KitchenAbvGr', 'KitchenQual',
       'TotRmsAbvGrd', 'Functional', 'Fireplaces', 'FireplaceQu', 'GarageType',
       'GarageYrBlt', 'GarageFinish', 'GarageCars', 'GarageArea', 'GarageQual',
       'GarageCond', 'PavedDrive', 'WoodDeckSF', 'OpenPorchSF',
       'EnclosedPorch', '3SsnPorch', 'ScreenPorch', 'PoolArea', 'PoolQC',
       'Fence', 'MiscFeature', 'MiscVal', 'MoSold', 'YrSold', 'SaleType',
       'SaleCondition', 'SalePrice'],
      dtype='object')

In [15]:
df.values

# melihat values
# akan berbubah ke numpy

array([[1, 60, 'RL', ..., 'WD', 'Normal', 208500],
       [2, 20, 'RL', ..., 'WD', 'Normal', 181500],
       [3, 60, 'RL', ..., 'WD', 'Normal', 223500],
       ...,
       [1458, 70, 'RL', ..., 'WD', 'Normal', 266500],
       [1459, 20, 'RL', ..., 'WD', 'Normal', 142125],
       [1460, 20, 'RL', ..., 'WD', 'Normal', 147500]], dtype=object)

In [14]:
# merubah series ke dataframe

matematika = pd.Series({"bagus":70, "mikiw":78, "nisa":88})
fisika = pd.Series({"bagus":80, "mikiw":75, "nisa":78})
kimia = pd.Series({"bagus":75, "mikiw":76, "nisa":86})

In [15]:
mapel = pd.DataFrame({"matematika":matematika, "fisika":fisika, "kimia":kimia})

In [16]:
mapel

       matematika  fisika  kimia
bagus          70      80     75
mikiw          78      75     76
nisa           88      78     86

In [16]:
type(mapel)

pandas.core.frame.DataFrame

In [15]:
mapel["matematika"]

bagus    70
mikiw    78
nisa     88
Name: matematika, dtype: int64

In [18]:
mapel.matematika

bagus    70
mikiw    78
nisa     88
Name: matematika, dtype: int64

In [17]:
type(mapel["matematika"])

pandas.core.series.Series

In [20]:
mapel[["matematika"]]

       matematika
bagus          70
mikiw          78
nisa           88

In [21]:
mapel[["matematika", "kimia"]]

       matematika  kimia
bagus          70     75
mikiw          78     76
nisa           88     86

In [23]:
take_col = ["fisika", "kimia"]
mapel[take_col]

       fisika  kimia
bagus      80     75
mikiw      75     76
nisa       78     86

### iloc dan loc
- df.iloc[idx_row_start:idx_row_end, col_star:col_end]

##### iloc
- akses dengan index int

In [24]:
mapel.iloc[1:3, 1:3]

       fisika  kimia
mikiw      75     76
nisa       78     86

In [27]:
irow_list = [0,2]
icol_list = [0,2]

mapel.iloc[row_list, col_list]

       matematika  kimia
bagus          70     75
nisa           88     86

In [34]:
mapel.iloc[:,-1:]

       kimia
bagus     75
mikiw     76
nisa      86

##### loc
- akses dengan index label

In [26]:
mapel.loc["bagus":"nisa", "fisika":"kimia"]

       fisika  kimia
bagus      80     75
mikiw      75     76
nisa       78     86

In [28]:
row_list = ["nisa", "bagus"]
col_list = ["kimia", "fisika"]

mapel.loc[row_list, col_list]

       kimia  fisika
nisa      86      78
bagus     75      80

###

- akses dengan logical operator

In [37]:
kkm_fisika = mapel["fisika"] > 75
kkm_fisika

bagus     True
mikiw    False
nisa      True
Name: fisika, dtype: bool

In [39]:
kkm_matematika = mapel["matematika"] > 75
kkm_matematika

bagus    False
mikiw     True
nisa      True
Name: matematika, dtype: bool

In [38]:
mapel[kkm_fisika]

       matematika  fisika  kimia
bagus          70      80     75
nisa           88      78     86

In [40]:
mapel[kkm_fisika | kkm_matematika] # or

       matematika  fisika  kimia
bagus          70      80     75
mikiw          78      75     76
nisa           88      78     86

In [41]:
mapel[kkm_fisika & kkm_matematika] # and

      matematika  fisika  kimia
nisa          88      78     86

##### Data Transformasion

In [29]:
# menambah 10% nilai fisika

def fisika_tambah(x):
    z = x + 0.1 * x
    return z

In [30]:
mapel[["fisika"]].apply(fisika_tambah)

       fisika
bagus    88.0
mikiw    82.5
nisa     85.8

In [36]:
mapel["fisika bonus"] = mapel[["fisika"]].apply(fisika_tambah).astype("int")

In [37]:
mapel

       matematika  fisika  kimia  fisika bonus
bagus          70      80     75            88
mikiw          78      75     76            82
nisa           88      78     86            85

In [ ]:
# menggabung dataframe
# df_gabung = df1.append(df2, ignore_index = True)

In [35]:
mapel.melt?

In [ ]:
# teknik melt
# df.melt()